loadTest.yml
config:
  target: http://localhost:4000
  phases:
    - duration: 60
      arrivalRate: 200
      maxVusers: 200
      name: Warm up phase
    # - duration: 60
    #   arrivalRate: 20
    #   maxVusers: 300
    #   name: Ramp up load
    # - duration: 60
    #   arrivalRate: 30
    #   maxVusers: 500
    #   name: Peak phase
  plugins:
    ensure: {}
    apdex: {}
    # metrics-by-endpoint: {}
  apdex:
    threshold: 400 # satisfy response time
  ensure:
    thresholds:
      # - http.response_time.p99: 100
      # - http.response_time.p95: 75
      - vusers.failed: 1
    maxErrorRate: 1
scenarios:
  - flow:
      # - log: "POST new product"
      - post:
          url: "/product"
          json:
            name: "{{$randomString()}}"
          capture:
            json: "$.data.id"
            as: productId
      # - think: 1
      # - log: "GET product {{ productId }}"
      - get:
          url: "/product/{{ productId }}"